public class Main {
    public static void main(String[] args) {
        // Задание 1
        int clientOS = 0;
        if (clientOS == 0) {
            System.out.println(" Установиет версию приложения для IOS по ссылке");
        } if (clientOS == 1)  {
                System.out.println(" Установите версию приложения для Android по ссылке");
        } // Задание 2
        int clientOs = 1;
        int clientDeviceYear = 2020;
        if (clientDeviceYear >= 2015) {
            System.out.println();
        }

    }
}